001_Конспекты_2/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заметки</name>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.Темы</types>
    </type>
  </attributes>
  <attributes>
    <name>Лекция</name>
    <type>
      <types>CatalogRef.Лекции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Поля</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Тэг</name>
      <type>
        <types>CatalogRef.Тэги</types>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>CatalogRef.ЗаметкиФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Примечания</name>
    <attributes>
      <name>Текстовка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>EnumRef.ВидыПримечаний</types>
      </type>
    </attributes>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

001_Конспекты_2/src/Catalogs/Тэги/Тэги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тэги</name>
  <predefined>
    <items>
      <name>a</name>
      <description>a</description>
    </items>
    <items>
      <name>File</name>
      <description>File</description>
    </items>
    <items>
      <name>H1</name>
      <description>H1</description>
    </items>
    <items>
      <name>H2</name>
      <description>H2</description>
    </items>
    <items>
      <name>H3</name>
      <description>H3</description>
    </items>
    <items>
      <name>H4</name>
      <description>H4</description>
    </items>
    <items>
      <name>H5</name>
      <description>H5</description>
    </items>
    <items>
      <name>H6</name>
      <description>H6</description>
    </items>
    <items>
      <name>img</name>
      <description>Img</description>
    </items>
    <items>
      <name>Label</name>
      <description>Label</description>
    </items>
    <items>
      <name>li</name>
      <description>li</description>
    </items>
    <items>
      <name>p</name>
      <description>p</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Одиночный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

001_Конспекты_2/src/Catalogs/Заметки/Forms/ФормаРедактирования/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗначениеЗаполнено(ВведенныйТекст) Тогда
		СтруктураПараметров = Новый Структура("ВведенныйТекст", ВведенныйТекст);
		Если ПараграфФл Тогда
			СтруктураПараметров.Вставить("Тэг", ПредопределенноеЗначение("Справочник.Тэги.p"));
		Иначе
			Если Строка(ЗаголовокHTML) = "ур 1" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H1");
			ИначеЕсли Строка(ЗаголовокHTML) = "ур 2" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H2");
			ИначеЕсли Строка(ЗаголовокHTML) = "ур 3" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H3");
			ИначеЕсли Строка(ЗаголовокHTML) = "ур 4" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H4");
			ИначеЕсли Строка(ЗаголовокHTML) = "ур 5" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H5");
			ИначеЕсли Строка(ЗаголовокHTML) = "ур 6" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H6");
			КонецЕсли;	
			СтруктураПараметров.Вставить("Тэг", Тэг);	
		КонецЕсли; 
			
		ОповеститьОВыборе(СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 УстановитьВидимостьТэгов(Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПараграфФлПриИзменении(Элемент)
	Если ПараграфФл Тогда
		 УстановитьВидимостьТэгов(Истина);
	Иначе
		 УстановитьВидимостьТэгов(Ложь);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокФлПриИзменении(Элемент)
	Если ЗаголовокФл Тогда
		 УстановитьВидимостьТэгов(Ложь);
	Иначе
		 УстановитьВидимостьТэгов(Истина);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьВидимостьТэгов(Састояние)
	ПараграфФл 	= Састояние;
	ЗаголовокФл = Не Састояние;
	
	Элементы.Заголовок.Видимость 	= ЗаголовокФл;
	//Элементы.ЗаголовокФл.Видимость 	= ЗаголовокФл;
КонецПроцедуры

#КонецОбласти
